## Plan Result (prod_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain_www[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_C[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_C[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sptribs-dss-update-case-web&#34;]
* Update
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;cui-ra&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;sptribs-dss-update-case-web&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod"
      + expiration_date          = (known after apply)
      + host_name                = "update.special-tribunals.service.gov.uk"
      + id                       = (known after apply)
      + name                     = "sptribs-dss-update-case-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "CustomerCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain_www["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain_www" {
      + cdn_frontdoor_profile_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod"
      + expiration_date          = (known after apply)
      + host_name                = "www.update.special-tribunals.service.gov.uk"
      + id                       = (known after apply)
      + name                     = "wwwsptribs-dss-update-case-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "CustomerCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_C["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_C" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/afdEndpoints/hmcts-prod"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/sptribs-dss-update-case-web"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/sptribs-dss-update-case-web/origins/sptribs-dss-update-case-web",
        ]
      + enabled                         = true
      + forwarding_protocol             = "HttpOnly"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "sptribs-dss-update-case-web"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Https",
        ]

      + cache {
          + compression_enabled           = false
          + query_string_caching_behavior = "UseQueryString"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/afdEndpoints/hmcts-prod"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/defaultBackend"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/defaultBackend/origins/defaultBackend",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/ruleSets/httpsredirect",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "sptribs-dss-update-case-webHttpsRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_C["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_C" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/afdEndpoints/hmcts-prod"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/sptribs-dss-update-case-web"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/sptribs-dss-update-case-web/origins/sptribs-dss-update-case-web",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/ruleSets/sptribsdssupdatecasewebwwwredirectruleset",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "sptribs-dss-update-case-webwwwRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["sptribs-dss-update-case-web"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/sptribsdssupdatecaseweb-managed-secret" -> (known after apply)
        name                       = "sptribsdssupdatecaseweb-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/special-tribunals-service-gov-uk" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/update-special-tribunals-service-gov-uk" # forces replacement
              ~ subject_alternative_names = [
                  - "special-tribunals.service.gov.uk",
                  - "www.special-tribunals.service.gov.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod"
      + id                       = (known after apply)
      + name                     = "sptribsdssupdatecasewebprodPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sptribsdssupdatecasewebprodPremium"

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["cui-ra"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/manage-your-support-for-hmcts-services.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }
      + record {
          + value = "2ps1j2h041pfjf76s74vr85n9fzssdtv"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.update"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "special-tribunals.service.gov.uk"

      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 11 to add, 2 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2133,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->